app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
---
  def index
    @activities = Activity.all

INSERT INTO "activities" ("class_name", "class_code", "colour", "description", "weeks", "days", "hours", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @activity = Activity.new(activity_params)
    @hamming = hamming_weight(@activity.hours)
    @activity.update_attribute(:hamming_weight, @hamming)
    respond_to do |format|
      if @activity.save

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_activity
      @activity = Activity.find(params[:id])