app/controllers/admins_controller.rb

SELECT "restriction_levels".* FROM "restriction_levels" ORDER BY "restriction_levels"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @all_levels = RestrictionLevel.all_levels
    @SAGov_restrictions_website = SAGov_restrictions_website
    @level_object = RestrictionLevel.first

SELECT "restriction_levels".* FROM "restriction_levels" ORDER BY "restriction_levels"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "restriction_levels" SET "level_current" = ?, "level_name" = ?, "updated_at" = ? WHERE "restriction_levels"."id" = ?  [["level_current", 3], ["level_name", "3: Medium restrictions"], ["updated_at", "2021-08-21 01:52:36.963344"], ["id", 1]]
---
  def set_restriction_level
    @level_new_name = params[:level][:level]
    @all_levels = RestrictionLevel.all_levels
    @level_new_current = @level_new_name[0]
    current_restriction = RestrictionLevel.first
    current_restriction.update!({:level_current=>@level_new_current.to_i, :level_name=>@level_new_name})