app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers" ORDER BY "teachers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @teachers = Teacher.all

SELECT "weeklies".* FROM "weeklies" WHERE "weeklies"."id" = ? ORDER BY "weeklies"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "activities".* FROM "activities" INNER JOIN "activities_teachers" ON "activities"."id" = "activities_teachers"."activity_id" WHERE "activities_teachers"."teacher_id" = ?  [["teacher_id", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def weekly
    @teacher = Teacher.where(:uni_id => session[:uni_id]).first
    @weekly = Weekly.where(:id => (params[:id].to_i - 9)).first
    week_bit = @weekly.week.to_i
    @activities = Teacher.where(:uni_id => session[:uni_id]).first.activities
    @this_week = Array.new(16){Array.new(7,1)}
    @time_names = ["9:00 am","","10:00 am","","11:00 am","","12:00 pm","","1:00 pm","","2:00 pm","","3:00 pm","","4:00 pm","",]
    @day_bits = [1,2,4,8,16,32,64]
    @hours = [65536,131072,262144,524288,1048576,2097152,4194304,8388608,16777216,33554432,67108864,134217728,268435456,536870912,1073741824,2147483648]
    @act_details = []
    @clashes = []
    @day_bits.each_with_index do |day,i|
      @hours.each_with_index do |time,j|
        @activities.each do |act|

INSERT INTO "teachers" ("uni_id", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uni_id", "a1674564"], ["first_name", "Aufeef"], ["last_name", "Chauhan"], ["created_at", "2021-09-06 02:21:50.379364"], ["updated_at", "2021-09-06 02:21:50.379364"]]
---
  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_teacher
    @teacher = Teacher.find(params[:id])