app/controllers/weeklies_controller.rb

  def index
    @weeklies = Weekly.all
---
SELECT "weeklies".* FROM "weeklies"

  def show
    week_bit = @weekly.week.to_i
    @activities = Activity.all
    @this_week =[]
    @hours = [65536,131072,262144,524288,1048576,2097152,4194304,8388608,16777216,33554432,67108864,134217728,268435456,536870912,1073741824,2147483648]
    @activities.each do |activity|
---
SELECT "activities".* FROM "activities"

  def create
    @weekly = Weekly.new(weekly_params)

    respond_to do |format|
      if @weekly.save
---
INSERT INTO "weeklies" ("week", "created_at", "updated_at") VALUES (?, ?, ?)  [["week", "256"], ["created_at", "2021-09-06 03:40:29.622997"], ["updated_at", "2021-09-06 03:40:29.622997"]]

    def set_weekly
      @weekly = Weekly.find(params[:id])
---
SELECT "weeklies".* FROM "weeklies" WHERE "weeklies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]